{
    "queue.block_at": {
        "description": "Количество активных реквестов, при достижении которого очередь закрывается",
        "value_type": "natural",
        "default": "50"
    },
    "queue.unblock_at": {
        "description": "Количество активных реквестов, при достижении которого закрытая очередь вновь открывается",
        "value_type": "uint",
        "default": "30"
    },
    "queue.block_enabled": {
        "description": "Блокировать ли очередь автоматически при достижении заданного числа активных реквестов",
        "value_type": "bool",
        "default": "true"
    },
    "queue.unblock_enabled": {
        "description": "Открывать ли очередь автоматически при достижении заданного числа активных реквестов",
        "value_type": "bool",
        "default": "false"
    },
    "queue.blocked": {
        "description": "Закрыты ли реквесты (может переключаться как вручную, так и автоматически)",
        "value_type": "bool",
        "default": "false"
    },
    "cooldown.post_request_user_cd": {
        "description": "Промежуток времени, в течение которого после успешной отправки реквеста пользователю будет запрещено создавать новый. Формат описан в /help duration. Значение 0 отключает данный кулдаун",
        "value_type": "duration",
        "default": "3d"
    },
    "cooldown.post_reject_level_cd": {
        "description": "Промежуток времени, в течение которого после отклонения реквеста будет запрещено повторно реквестить тот же уровень. Формат описан в /help duration. Значение 0 отключает данный кулдаун",
        "value_type": "duration",
        "default": "1w"
    },
    "request.append_conclusion_to_review": {
        "description": "Указывать ли решение, вынесенное обычным ревьюером по уровню, под текстом его обзора (не влияет на итоговые решения под ревью игровых модераторов)",
        "value_type": "bool",
        "default": "false"
    },
    "request.append_conclusion_to_final_review": {
        "description": "Указывать ли решение, вынесенное модератором по уровню, под текстом его обзора (не влияет на предварительные решения под ревью обычных ревьюеров)",
        "value_type": "bool",
        "default": "false"
    },
    "request.min_stars_to_require_showcase": {
        "description": "Для классических уровней с запрошенным количеством звезд, большим или равным указанному, шоукейс будет обязателен (для платформеров он обязателен всегда)",
        "value_type": "natural",
        "default": "10"
    },
    "request.always_require_showcase": {
        "description": "Если включено, шоукейс будет обязателен вне зависимости от сложности и типа уровня",
        "value_type": "bool",
        "default": "false"
    },
    "trainee.resolved_reviews_for_promotion_decision": {
        "description": "Количество оцененных ревью кандидата в обзорщики, начиная с которого задается вопрос о повышении кандидата",
        "value_type": "natural",
        "default": "3"
    }
}