{
  "common.success": {
    "description": "Стандартный ответ на успешное действие",
    "eng": "Success",
    "rus": "Действие успешно выполнено"
  },
  "common.language_selection_proposal_subtext": {
    "description": "Примечание, советующее пользователям, не установившим язык бота, сделать это",
    "eng": "If you don't speak Russian or you don't want to see this note, use `/language` to set the bot's language",
    "rus": "Если Вы говорите по-русски или не хотите видеть это примечание, установите язык бота командой `/language`"
  },
  "permission.no_assigned_roles": {
    "description": "Сообщение, которое выводится при попытке вывести роли, связанные с разрешениями бота, когда ни одной такой роли нет",
    "eng": "No role is granted with bot permissions",
    "rus": "Ни к одной роли не привязаны разрешения бота"
  },
  "permission.member_has_no_permissions": {
    "description": "Сообщение, которое выводится при попытке вывести разрешения конкретного пользователя, когда у него/нее нет ни одного",
    "param_descriptions": {
      "member_mention": "Тег пользователя, информация про разрешения которого была запрошена"
    },
    "eng": "{member_mention} has no permissions",
    "rus": "У {member_mention} нет разрешений"
  },
  "log.no_entries": {
    "description": "Сообщение, которое выводится при попытке вывести логи, когда ни одной записи, удовлетворяющей заданному фильтру, не найдено",
    "eng": "No logs matching the active filter are found. If you expected some entries to show up, check your filtering settings",
    "rus": "Логи, удовлетворяющие активному фильтру, не найдены. Если ожидалось, что таковые найдутся, проверьте настройки своего фильтра"
  },
  "log.no_filters": {
    "description": "Сообщение, которое выводится при попытке вывести список фильтров логов, когда он пуст",
    "eng": "There are no saved filters",
    "rus": "Нет ни одного сохраненного фильтра"
  },
  "log.top_reached": {
    "description": "Пометка, добавляющаяся к сообщению с логами, когда достигнута самая старая запись",
    "eng": "You've reached the oldest entry",
    "rus": "Начало логов"
  },
  "log.bottom_reached": {
    "description": "Пометка, добавляющаяся к сообщению с логами, когда достигнута самая недавняя запись",
    "eng": "You've reached the most recent entry",
    "rus": "Конец логов"
  },
  "log.empty_filter": {
    "description": "Сообщение, выводящееся при попытке вывести описание пустого (т. е. допускающего любые записи) фильтра",
    "eng": "Filter has no restrictions",
    "rus": "Фильтр не имеет ограничений"
  },
  "log.empty_filter_wont_be_saved": {
    "description": "Отказ, выводящийся при попытке сохранить пустой (т. е. допускающий любые записи) фильтр",
    "eng": "You're trying to save an empty filter, which is pointless. Hence, no filter will be saved",
    "rus": "Фильтр пуст, поэтому он не будет сохранен (сохранять пустой фильтр не имеет смысла)"
  },
  "request_command.closed": {
      "description": "Сообщение, выводящееся при попытке создать новый реквест в момент, когда очередь закрыта",
      "eng": "Sorry, the requests are temporarily closed. Follow the announcements to be notified when the queue will be reopened",
      "rus": "Реквесты временно закрыты. Следите за объявлениями, чтобы узнать об открытии очереди реквестов одним из первых"
  },
  "request_command.unfeatured": {
      "description": "Сообщение, выводящееся при попытке зареквестить уровень, у которого ранее снимали фичур",
      "param_descriptions": {
        "level_name": "Название уровня. Ожидается, что оно уже отформатировано как код"
      },
      "eng": "Failed to send a level request: level {level_name} was unfeatured by RobTop previously",
      "rus": "Реквест не отправлен: у уровня {level_name} ранее уже был отозван фичур"
  },
  "request_command.already_rated": {
      "description": "Сообщение, выводящееся при попытке зареквестить уже оцененный уровень",
      "param_descriptions": {
        "level_name": "Название уровня. Ожидается, что оно уже отформатировано как код",
        "level_quality": "Качество уровня (rated/featured/epic/...). Ожидается, что оно представлено в виде неформатированного текста"
      },
      "eng": "Failed to send a level request: level {level_name} is already {level_quality}!",
      "rus": "Реквест не отправлен: уровень {level_name} уже оценен (как {level_quality})!"
  },
  "request_command.not_found": {
      "description": "Сообщение, выводящееся, когда не получается найти по ID уровень, который пытается зареквестить пользователь",
      "param_descriptions": {
        "level_id": "ID уровня, предоставленное пользователем. Ожидается, что он уже отформатирован как код"
      },
      "eng": "Failed to send a level request: level not found (ID `{level_id}`)!",
      "rus": "Реквест не отправлен: уровень с ID `{level_id}` не найден!"
  },
  "confirmation.override_filter": {
    "description": "Подтверждение перезаписи существующего фильтра",
    "param_descriptions": {
      "name": "Название перезаписываемого фильтра"
    },
    "eng": "A filter with the name {name} already exists. Override?",
    "rus": "Фильтр с именем {name} уже существует. Перезаписать?"
  },
  "confirmation.delete_filter": {
    "description": "Подтверждение удаления фильтра",
    "param_descriptions": {
      "name": "Название удаляемого фильтра"
    },
    "eng": "Delete filter {name}?",
    "rus": "Удалить фильтр {name}?"
  },
  "warning.no_effect": {
    "description": "Стандартный ответ на действие, не возымевшее эффекта из-за того, что все и так уже в нужном состоянии (например, при передаче уже используемого значения параметра в качестве нового, на которое надо его поменять)",
    "eng": "No changes were applied: the data is already in the desired state",
    "rus": "Изменения не были применены: данные уже находятся в желаемом состоянии"
  },
  "error.component_error": {
    "description": "Сообщение, выводящееся при любой ошибке взаимодействия с компонентом (скорее всего, вызванной изъянами в коде бота)",
    "param_descriptions": {
      "error_traceback": "Текст ошибки, уже отформатированный как блок кода"
    },
    "eng": "An error occurred while interacting with this component:\n{error_traceback}",
    "rus": "Произошла ошибка при взаимодействии с компонентом:\n{error_traceback}"
  },
  "error.command_error": {
    "description": "Сообщение, выводящееся при любой внутренней ошибке команды (такие вызваны изъянами в коде бота)",
    "param_descriptions": {
      "admin_mention": "Тег админа сервера, к которому просит обратиться бот",
      "error_traceback": "Текст ошибки, уже отформатированный как блок кода и сокращенный до разумных пределов"
    },
    "eng": "An error occurred:\n{error_traceback}\nPlease notify {admin_mention}",
    "rus": "Произошла ошибка:\n{error_traceback}\nСвяжитесь с {admin_mention}"
  },
  "error.forbidden": {
    "description": "Стандартный отказ выполнить действие из-за отсутствия прав",
    "param_descriptions": {
      "admin_mention": "Тег админа сервера, к которому отсылает бот при несогласии пользователя с отказом"
    },
    "eng": "Not enough permissions. If you believe this is a mistake, please contact {admin_mention}",
    "rus": "Недостаточно прав. Обратитесь к {admin_mention}, если считаете, что произошла ошибка"
  },
  "error.filter_doesnt_exist": {
    "description": "Ошибка, возникающая при попытке выбрать несуществующий фильтр",
    "param_descriptions": {
      "name": "Отформатированное как код название фильтра, предоставленное пользователем"
    },
    "eng": "Filter does not exist: {name}",
    "rus": "Фильтр {name} не существует"
  },
  "error.cant_parse_timestamp": {
    "description": "Ошибка, возникающая при невозможности обработать предоставленную пользователем строчку как временную метку",
    "param_descriptions": {
      "raw": "Предоставленная пользователем строчка. Ожидается, что она уже отформатирована как код"
    },
    "eng": "Failed to parse timestamp from text: {raw} is not a valid timestamp",
    "rus": "Не удалось обработать строчку {raw} как временную метку"
  },
  "error.cant_remove_admin_permission": {
    "description": "Сообщение, выводящееся при попытке осуществить действие, которое лишит исполнителя команды права администратора",
    "eng": "This action would take away your admin permission. This is not allowed due to the safety reasons. If you really want to resign, remove your admin role or ask another admin to perform this action (considering this won't leave them without their admin rights too)",
    "rus": "Это действие забрало бы у Вас разрешения администратора. Это запрещено по причинам безопасности. Если Вы действительно хотите сложить полномочия, уберите у себя роль, дающую права администратора бота, или попросите осуществить это действие другого администратора (если оно не лишит его/ее права администратора)"
  },
  "error.wrong_parameter_value_type": {
    "description": "Ошибка, возникающая при невозможности привести переданное пользователем значение к типу параметра, значение которого пользователь пытается обновить",
    "param_descriptions": {
      "value": "Строчка, предоставленная юзером в качестве значения параметра. Ожидается, что она уже предварительно отформатирована как код",
      "param_type": "Тип параметра, которому попытались присвоить значение. Ожидается, что он уже предварительно отформатирован как код"
    },
    "eng": "Cannot assign the passed value: {value}. Only the values of the following type are admitted: {param_type}",
    "rus": "Не удалось присвоить параметру значение {value}. Разрешены значения, принадлежащие только к типу {param_type}"
  },
  "error.bad_duration_format": {
    "description": "Ошибка, возникающая при предоставлении невалидной строки в качестве длительности (например, бана)",
    "param_descriptions": {
      "duration": "Строчка, предоставленная юзером в качестве длительности. Ожидается, что она уже предварительно отформатирована как код"
    },
    "eng": "Failed to parse a duration from string: {duration}. The expected format is described [here](https://en.wikipedia.org/wiki/ISO_8601#Durations)",
    "rus": "Не удалось спарсить продолжительность из предоставленной строки: {duration}. Ожидаемый формат описан [здесь](https://en.wikipedia.org/wiki/ISO_8601#Durations)"
  },
  "error.expected_positive_duration": {
    "description": "Ошибка, возникающая, когда юзер пытается передать в команду отрицательную длительность (например, бана)",
    "param_descriptions": {
      "duration_secs": "Длительность бана в секундах, предоставленная пользователем"
    },
    "eng": "Cannot do that for a negative amount of time (got: {duration_secs} seconds)",
    "rus": "Данное действие не позволяет указать отрицательную продолжительность (в данном случае, {duration_secs} секунд)"
  }
}

