{
  "common.success": {
    "description": "Стандартный ответ на успешное действие",
    "eng": "Success",
    "rus": "Действие успешно выполнено"
  },
  "common.language_selection_proposal_subtext": {
    "description": "Примечание, советующее пользователям, не установившим язык бота, сделать это",
    "eng": "If you don't speak Russian or you don't want to see this note, use `/language` to set the bot's language",
    "rus": "Если Вы говорите по-русски или не хотите видеть это примечание, установите язык бота командой `/language`"
  },
  "permission.no_assigned_roles": {
    "description": "Сообщение, которое выводится при попытке вывести роли, связанные с разрешениями бота, когда ни одной такой роли нет",
    "eng": "No role is granted with bot permissions",
    "rus": "Ни к одной роли не привязаны разрешения бота"
  },
  "permission.member_has_no_permissions": {
    "description": "Сообщение, которое выводится при попытке вывести разрешения конкретного пользователя, когда у него/нее нет ни одного",
    "param_descriptions": {
      "member_mention": "Тег пользователя, информация про разрешения которого была запрошена"
    },
    "eng": "{member_mention} has no permissions",
    "rus": "У {member_mention} нет разрешений"
  },
  "warning.no_effect": {
    "description": "Стандартный ответ на действие, не возымевшее эффекта из-за того, что все и так уже в нужном состоянии (например, при передаче уже используемого значения параметра в качестве нового, на которое надо его поменять)",
    "eng": "No changes were applied: the data is already in the desired state",
    "rus": "Изменения не были применены: данные уже находятся в желаемом состоянии"
  },
  "error.forbidden": {
    "description": "Стандартный отказ выполнить действие из-за отсутствия прав",
    "param_descriptions": {
      "admin_mention": "Тег админа сервера, к которому отсылает бот при несогласии пользователя"
    },
    "eng": "Not enough permissions. If you believe this is a mistake, please contact {admin_mention}",
    "rus": "Недостаточно прав. Обратитесь к {admin_mention}, если считаете, что произошла ошибка"
  },
  "error.cant_remove_admin_permission": {
    "description": "Сообщение, выводящееся при попытке осуществить действие, которое лишит исполнителя команды права администратора",
    "eng": "This action would take away your admin permission. This is not allowed due to the safety reasons. If you really want to resign, remove your admin role or ask another admin to perform this action (considering this won't leave them without their admin rights too)",
    "rus": "Это действие забрало бы у Вас разрешения администратора. Это запрещено по причинам безопасности. Если Вы действительно хотите сложить полномочия, уберите у себя роль, дающую права администратора бота, или попросите осуществить это действие другого администратора (если оно не лишит его/ее права администратора)"
  },
  "error.wrong_parameter_value_type": {
    "description": "Ошибка, возникающая при невозможности привести переданное пользователем значение к типу параметра, значение которого пользователь пытается обновить",
    "param_descriptions": {
      "value": "Строчка, предоставленная юзером в качестве значения параметра. Ожидается, что она уже предварительно отформатирована как код",
      "param_type": "Тип параметра, которому попытались присвоить значение. Ожидается, что он уже предварительно отформатирован как код"
    },
    "eng": "Cannot assign the passed value: {value}. Only the values of the following type are admitted: {param_type}",
    "rus": "Не удалось присвоить параметру значение {value}. Разрешены значения, принадлежащие только к типу {param_type}"
  },
  "error.bad_duration_format": {
    "description": "Ошибка, возникающая при предоставлении невалидной строки в качестве длительности (например, бана)",
    "param_descriptions": {
      "duration": "Строчка, предоставленная юзером в качестве длительности. Ожидается, что она уже предварительно отформатирована как код"
    },
    "eng": "Failed to parse a duration from string: {duration}. The expected format is described [here](https://en.wikipedia.org/wiki/ISO_8601#Durations)",
    "rus": "Не удалось спарсить продолжительность из предоставленной строки: {duration}. Ожидаемый формат описан [здесь](https://en.wikipedia.org/wiki/ISO_8601#Durations)"
  },
  "errors.expected_positive_duration": {
    "description": "Ошибка, возникающая, когда юзер пытается передать в команду отрицательную длительность (например, бана)",
    "param_descriptions": {
      "duration_secs": "Длительность бана в секундах, предоставленная пользователем"
    },
    "eng": "Cannot do that for a negative amount of time (got: {duration_secs} seconds)",
    "rus": "Данное действие не позволяет указать отрицательную продолжительность (в данном случае, {duration_secs} секунд)"
  },
  "errors.duration_exceeds_max_allowed": {
      "description": "Ошибка, возникающая при передаче продолжительности больше разрешенного максимума",
      "param_descriptions": {
        "max_duration_secs": "Максимально допустимая продолжительность в секундах"
      },
      "eng": "Provided duration exceeds the maximum allowed ({max_duration_secs} secs)",
      "rus": "Предоставленная продолжительность превышает максимально допустимую ({max_duration_secs} секунд)"
  }
}

